namespace MStudyLog
{
    public class T5Process
    {
        #region 知识点一 进程
        //进程（Process）是计算机中的程序关于某数据集合上的一次运行活动
        //是系统进行资源分配和调度的基本单位，是操作系统结构的基础
        //说人话：打开一个应用程序就是在操作系统上开启了一个进程
        //讲程之间可以相石独立运行，互不干扰
        //进程之间也可以相互访问、操作
        
        #endregion

        #region 二 线程
        //操作系统能够进行运算调度的最小单位。
        //它被包含在进程之中，是进程中的实际运作单位
        //一条线程指的是进程中一个单一顺序的控制流，一个进程中可以并发多个线程
        //我们目前写的程序都在主线程中
        //简单理解线程；
        //就是代码从上到下运行的一条“管道”
        

        #endregion

        public void a()
        {
            
        }
        
    }
}